class Exam < ActiveRecord::Base
    has_many :exam_images, :dependent => :delete_all

    YEAR = {
            '2005' => 'red',
            '2006' => 'orange',
            '2007' => 'yellow',
            '2008' => 'green',
            '2009' => 'orange',
            '2010' => 'yellow',
            '2011' => 'green',
            '2012' => 'blue',
            '2013' => 'yellow',
            '2014' => 'green',
            '2015' => 'blue',
            '2016' => 'purple',
            '2017' => 'green'
    }

    YEAR_YEAR = {
            '2005' => '2005',
            '2006' => '2006',
            '2007' => '2007',
            '2008' => '2008',
            '2009' => '2009',
            '2010' => '2010',
            '2011' => '2011',
            '2012' => '2012',
            '2013' => '2013',
            '2014' => '2014',
            '2015' => '2015',
            '2016' => '2016',
            '2017' => '2017'
    }

    ORG_ORG = {
            '수능' => 'purple',
            '교육청' => 'yellow',
            '평가원' => 'blue',
            '모의고사' => 'red'
    }
end
